In [1]:
import pandas as pd
import numpy as np

In [4]:
data = {'國家:' ,
       '人口:' }
data=pd.DataFrame()

In [27]:
data=np.random.randint(100,100001,size=5)
data

array([65520, 82316, 76866, 95187, 13130])

In [35]:
qq=pd.DataFrame(data)
qq

       0
0  65520
1  82316
2  76866
3  95187
4  13130

In [36]:
qq.insert(1,column="國家",value="Japan")
qq

       0     國家
0  65520  Japan
1  82316  Japan
2  76866  Japan
3  95187  Japan
4  13130  Japan

In [40]:
country = ["USA","UK","Japan","China","Taiwan"]
population= [50000000,3250000,1200000,80000000,2300000]
df=pd.DataFrame()
df["國家"]=country
df["人口"]=population
df

       國家        人口
0     USA  50000000
1      UK   3250000
2   Japan   1200000
3   China  80000000
4  Taiwan   2300000

In [45]:
df.loc[:,"人口"].max()

80000000